Config/Enums/AuthorizationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AuthorizationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сard</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SBPQR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PayQR</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/AuthorizationTypes/Ext/ManagerModule.bsl
#Region Public

// --------------------------------------------------------------------------------
// 
// Returns:
// Map  - Result
//
Function CodesByAuthorizationTypes() Export
	vMap = New Map();
	vMap.Insert(PredefinedValue("Enum.AuthorizationTypes.Сard"), 0);
	vMap.Insert(PredefinedValue("Enum.AuthorizationTypes.SBPQR"), 1);
	vMap.Insert(PredefinedValue("Enum.AuthorizationTypes.PayQR"), 2);
	Return vMap;
EndFunction // CodesByAuthorizationTypes

// --------------------------------------------------------------------------------
// 
// Returns:
//  Map - Result
//
Function AuthorizationTypesByCode() Export
	vMap = New Map();
	vMap.Insert(0, PredefinedValue("Enum.AuthorizationTypes.Сard"));
	vMap.Insert(1, PredefinedValue("Enum.AuthorizationTypes.SBPQR"));
	vMap.Insert(2, PredefinedValue("Enum.AuthorizationTypes.PayQR"));
	Return vMap;
EndFunction // AuthorizationTypesByCode

#EndRegion
